#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03ZWM4YjkyZi02NzEyLTRkZDUtOTBiYy1iNmY2NGNjY2ZjMGU7b2JqZWN0SWQ9ZDA1ODQyNGEtYjdjOC00Y2JmLTljYzktNmUwODkxNzAzNTdjO3N1YnNjcmlwdGlvbklkPTc3MzQ4ZTZjLTAyODYtNDk2Zi04MzM2LTI4ZTk2NmIxMzY0ODt0ZW5hbnRJZD1lNjBiYjc2Yy04ZmRhLTRlZDQtYTM1NC00ODM2ZTNiZmNiYzM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aca_env.azurerm_container_app_environment.env will be created
  + resource "azurerm_container_app_environment" "env" {
      + custom_domain_verification_id               = (known after apply)
      + dapr_application_insights_connection_string = (sensitive value)
      + default_domain                              = (known after apply)
      + docker_bridge_cidr                          = (known after apply)
      + id                                          = (known after apply)
      + infrastructure_subnet_id                    = (known after apply)
      + internal_load_balancer_enabled              = false
      + location                                    = "australiaeast"
      + log_analytics_workspace_id                  = (known after apply)
      + mutual_tls_enabled                          = false
      + name                                        = "env-biotrackr-prod-ae"
      + platform_reserved_cidr                      = (known after apply)
      + platform_reserved_dns_ip_address            = (known after apply)
      + resource_group_name                         = "rg-biotrackr-prod-ae"
      + static_ip_address                           = (known after apply)
      + tags                                        = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
      + zone_redundancy_enabled                     = true
    }

  # module.aca_subnet.azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.0.0/23",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "infrastructure-subnet"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-biotrackr-prod-ae"
      + virtual_network_name                           = "vnet-biotrackr-prod-ae"
    }

  # module.ai.azurerm_application_insights.ai will be created
  + resource "azurerm_application_insights" "ai" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "australiaeast"
      + name                                  = "ai-biotrackr-prod-ae"
      + resource_group_name                   = "rg-biotrackr-prod-ae"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
      + tags                                  = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
      + workspace_id                          = (known after apply)
    }

  # module.law.azurerm_log_analytics_workspace.law will be created
  + resource "azurerm_log_analytics_workspace" "law" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "australiaeast"
      + name                            = "law-biotrackr-prod-ae"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-biotrackr-prod-ae"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
      + workspace_id                    = (known after apply)
    }

  # module.resource_group.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "australiaeast"
      + name     = "rg-biotrackr-prod-ae"
      + tags     = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
    }

  # module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "australiaeast"
      + name                = "vnet-biotrackr-prod-ae"
      + resource_group_name = "rg-biotrackr-prod-ae"
      + subnet              = (known after apply)
      + tags                = {
          + "Application" = "biotrackr"
          + "Component"   = "Core-Infra"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: main.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "main.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @willvelida, Action: `pull_request`*